{"meta":{"title":"Hexo","subtitle":"","description":"AI for biomedicine<br />Chinese Academy of Sciences","author":"Zhang Zehong","url":"http://example.com","root":"/"},"pages":[{"title":"tags","date":"2022-08-17T14:36:36.000Z","updated":"2022-08-17T14:44:00.520Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2022-08-17T14:44:55.000Z","updated":"2022-08-17T14:45:13.882Z","comments":true,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"IELT notes","slug":"IELT-notes","date":"2022-08-30T11:16:26.000Z","updated":"2022-09-08T08:51:23.107Z","comments":true,"path":"2022/08/30/IELT-notes/","link":"","permalink":"http://example.com/2022/08/30/IELT-notes/","excerpt":"","text":"写作观点扩展可以写原因，也可以扩展描述抽象的观点。 比如远程教育更加灵活，怎么更加灵活，有什么表现：可以暂停回放， 可以不同方式学习（阅读或者看视频）；也可以说什么让远程教育更加灵活（why）：可以保存在网络上，随时下载。 优缺点表述：advantage &#x2F; disadvantage has downside &#x2F; of great value may be effective &#x2F; we should also consider other way 也许有效，但也要考虑其他方法 consider … as an alternative 将……作为替代方案 reverse this trend 扭转这种趋势 The focus should be on … 重点应该放在…… the improvement in … The advantages of the rich countries helping the poor are manifold. 富国帮助穷国的好处是多方面的。 词汇替换： in contrast be measured by &#x3D; measure sth &#x3D; sth be evaluated with &#x3D; top signallers &#x3D; is owed to (归功于) other factors &#x3D; remaining factors excluding the above &#x3D; relevant factor &#x3D; indicator 指标 &#x3D; standard 标准 be assessed and compared in 用…来评估和比较 a variety of 各种各样的，许多 &#x3D; manifold lead … to … &#x3D; allow … to … allow a variety of companies and industries to flourish 让各种公司和行业蓬勃发展 对于学生和年轻人：younger generation next generation 教育和能力 take away their study time, interfere with their studies 影响学习 improve their skills increase their practical experience 增加他们的实践经验 be confronted with many problems and challenges 遇到问题和挑战 be rare at school 在学校很少见 improve their problem-solving abilities 提高解决问题的能力 find enjoyment 找到乐趣 a sense of community 社区感 rewarding experience 有意义的经历 of educational value 有教育意义 suits students’ need 符合学生的需要 vocational training 职业培训 improve interpersonal skills 提高人际交往能力 shatter their confidence 粉碎他们的信心 complete a degree 拿到学位 attend lecture in person 亲自参加讲座(与远程学习相对) read relevant materials 阅读相关资料 comprehend some key concepts 理解一些关键概念 digest information 吃透知识 lecturer’s guidance 教师指导 completing all courses 完成所有课程 scholars from top universities 顶尖大学的学者 network experience 社交经验 build up a network of contacts 建立社交关系网 socialise together 社交 on campus 在校内 gain qualifications 获得合格证书 帮助他人： make a possible different to others 责任感： learn responsibility foster a sense of responsibility 培养责任感 课程： compulsory curriculum 必修课程 工作：进入公司： work-life balance 工作与生活的平衡 balance their work and personal life lead to more workloads and stress 工作量和压力更大 relevant 有价值的，有意义的（形容公司） competitive 有竞争力的（形容公司） the liberty and freedom 自由（替换freedom） opt for 选择（工作方式，工作岗位） be bound by the rules 被规则约束 （boss）dictate terms to them 老板对员工发号施令 work according to their own ways 按自己的方式工作 follow the dress code 遵守着装规范 live their lives 过日子 complete work 完成工作 自由职业： Be Self-Employed 为自己工作 working for oneself 为自己工作 work independently 独立工作 there is no guaranteed pay check 没有工资保障 stable income 稳定收入 make a living 维持生活 self discipline 自律 lack of discipline 缺乏约束 be answerable to 向…负责 skip deadlines 错过最后期限 missing the set targets 没有达到预定目标 deviate from the set targets 偏离预定目标 bear the consequences 承担后果 志愿工作&#x2F;社会工作： unpaid work 无偿劳动 volunteer work (work是不可数名词) 志愿工作 community services 社区服务 voluntary services clean street 清理街道 tend gardens 照料花园 remove graffiti 清理小广告 promoted 推广 be accepted as a requirement for graduation 作为毕业的一个条件 benefactors 捐助人，赞助人 organise events and functions 筹办活动 work closely with others &#x2F; cooperate with others 与他人合作 关于钱：raise funds 筹款（主语可以是人或政府） a wasteful use of time and money 浪费时间和金钱 at low prices 价格低 price cuts 价格降低（名词性） out of their budget 超出预算 within a budget 在预算之内 spend quite a fortune on 花了一大笔钱 expect to appreciate in value in the future 期望在未来升值（房子、投资） take out huge loans 贷款一大笔钱 repay the loan 偿还贷款 everyday expenses 日常开支 maintenance costs 维修费用 社会与科技发展：social progress 社会发展 technological innovations 技术创新 reduce the cost of production 减少生产成本 mass production 批量生产 improve the productivity of the workforce 提高劳动生产率 electronic products 电子产品 mobile phone with up-to-date features 具有最新功能的电话 people’s way of life 人们的生活方式 household appliances 家用电器 average life expectancy 平均预期寿命 availability of medical services 医疗服务提供情况 human rights 人权 levels of equality 社会公平 网络与多媒体 advent of the Internet 互联网的出现 distance education 远程教育 online course 在线课程 distance learning 远程学习 distance learning programmes 远程学习程序 attend video lessons 视频课程 virtual classes click the pause button replay the video interactive communication tools 传统媒体 经济与国际 economic progress 经济发展 economic growth 经济增长 economic advancement 经济赶超，经济发展 a booming economy 经济繁荣 gross domestic products 国内生产总值 imports and exports 进出口 trade with other countries 与其他国家的贸易 increased wealth 增加的财富，名词性词组 developed countries 发达国家 industrialised countries 工业化国家，发达国家 over dependent 过于依赖的（发展中国家过度依赖发达国家的援助） boost the country’s economic development 促进国家经济的发展 underpaying 少付工资的 exploiting the poor 剥削穷人 indirectly affect the rich countries 间接影响富国 joint efforts of all countries 各国的共同努力 have-nots 穷国，贫民 humanitarian grounds 人道主义理由 疾病 spread to 传到，蔓延到 房价与租房：landlord 房东 环境保护：awareness of environmental protection 环保意识 environmental awareness 环保意识 raise environmental awareness 提高环保意识 lack environmental awareness 缺乏环保意识（lack是动词） energy consumption 能源消耗 non-biodegradable products 难生物降解的产品 disposable products 一次性产品，不可回收物 plastic bags 塑料袋 eco-friendly alternatives 环境友好的替代品 have a destructive effect on the environment 破坏环境 sustainable lifestyle 可持续的生活方式 recycling 回收利用 use and dispose 使用与（使用后的）处理 excessive consumption of 过度消耗（product，energy…） 犯罪：罪犯 offenders 犯人 criminals 犯人 those who violate laws those who commit serious offence 犯下严重罪行的人 commit crimes 犯罪 prospective offenders 潜在的罪犯 habitual offenders 惯犯 criminal record 犯罪记录 minor crimes 轻微罪行 juvenile offenders 少年犯 juvenile crime 青少年犯罪 terrorism 恐怖主义 felon 重罪犯 violent crime 暴力犯罪 改造 a correctional method 一种改造方法 reform offenders 改造罪犯 imposing sentences 判刑 prison sentence 刑期，监狱服刑 sentence to prison lose freedom fight crime 打击犯罪 punishment 惩罚（不可数名词） repent 后悔，忏悔 reintegrating into society重新回到社会 given a lighter punishment 减轻处罚 防范 rational person 理智的人 law-abiding citizens 守法的公民 productive members of society 对社会有用的人 understand legal responsibility 理解法律责任 harsh penalty 严厉的刑罚 deter crime 震慑犯罪 prevent crime 预防犯罪 法律 （government can）enforce some laws 执行一些法律 tax penalty 税务罚款（对于某些事增加税率） 地图题比较：has been changed drastically except for … 除了…之外都变化很大 current layout 易错语法：时刻注意时态与三单 -s不加冠词，单数必加冠词 has increased year by year 逐年增长 a dramatic increase （不是dramatical）&#x2F; increased dramatically remained at this level 保持不变（at） fashionable &#x2F; in fashion，没有fashional这个词 on the Internet advantages to 在…方面有优势 media 本身是medium的复数形式 searching for key words，search不及物，后加名词必须加介词for 词汇替换：居民，人： dweller, inhabitant, resident, citizen, people, individual 国家： country, nation 购买： buy, purchase 钱 money, expenditure, cost, expenses 比例： the percentage of, the figure for 口语part1Watch是否戴手表？ 以前had worn，现在cell phone可以tell me what time it is. 是否收到手表作为礼物？ mother，when I was a child not expensive, but simple and practical help me manage my time 为什么一些人带着expensive watch？ status symbols, show off their wealth Mirror是否喜欢看镜子中的自己？ no, just a daily routine get up in the morning, tend to, tidy up整洁 是否用镜子当装饰？ hall of residence, no space for mirror 但在bathroom中，there’s a big mirror on the wall Advertisement是否喜欢？ interrupt TV programmes, annoying, misleading, promote products (推销产品) 是否想在广告行业工作？ no, not my major, 需要think out of box 打破常规, not suitable for me 不喜欢什么样的广告？ 保健品药品广告Advertisements for health products and medicines 大多数是虚假的misleading and harmful 一些老人被骗钱get cheated out of their money 是否会分享广告？ just share funny ones, 尽管我不喜欢大多数广告, I had to say, 一些是 creative and entertaining Art是否喜欢绘画？ 是的，当我是child时候我就喜欢绘画，事实上我认为我有绘画的天分 是否想learn more about art? 是的，描述art：help me express my feeling, is a creative hobby, is a good way to reduce stress 是否useful？ 是的, my major, help me record the structure and specific details of cell and tissue Singing是否曾经学过唱歌？ 是的，小学primary school student有sing course，但是没有机会深入学习learn more about If I had a chance, I would Famous people你是否知道famous people in your area? my tutor, famous scientist, find a series of new drugs, to help those patients Old building是否曾经在城市里看过old building？ wooden Buddhism buildings, built in Tang Dynasty, 它们中很多超过1000 years old, tourist attractions, because of their distinction and beauty 是否应该保护old building? 是 part of history of the city, connect us to the past, 帮助城市attract many tourists 更喜欢住在old building还是modern building? 老建筑可能不安全，新建筑equip with modern facilities，large windows，plenty of natural light，convenient，这对我来说很重要 有没有未来想看的old buildings？ 那些老建筑with historical and cultural value, 中国有一个很长的历史，有很多famous old building， distinctive and beautiful Hometown家乡不喜欢的地方有哪些？ personally, poor transportation，没有地铁，去市中心go shopping要好久 Mobile phone第一部手机是什么？ Xiaomi mobile phone，我bought it when I entered the university, 学校离我家远，用它connect with family and friends 用来calling 还是texting？ seldom call my friends or family, 因为costly, 现在有很多social media, like wechat，convenient, free 是否会买一个新的？ 不会，现在这个对我来说够用了，我不喜欢玩手机游戏mobile games，所以不需要换手机change it 手机如何改变你的生活？ online shopping, cheaper and more convenient than physical shops, use cell phone taking photos, 在任何时间，check emails，more effective Car是否喜欢travel by car when you were a kid? 不喜欢,have a carsickness, uncomfortable, prefer bike and subway Website最喜欢的website？ video website like bilibili, fun and creative videos Dream是否记住梦？是否晚上多梦？ 大多数情况下我completely forgot the dreams, sometimes I had vivid dreams 一些pleasant and meaningful，一些是nightmares 梦是否有特殊含义？ 不，没有，我认为梦只是 represent 我们current psychological stress 做太多梦说明我们的身体出现了问题，Mental or physical Morning or evening更喜欢早上还是晚上？ 不喜欢早起，因为我have a busy life, 需要go to workplace在早上 晚上after the work, 可以和朋友do some outdoor activities for leisure, I’m a evening person. 晚上做什么？ As I said, do some outdoor activities for leisure, always play badminton with friends 口语part3steps： Answer the question directly Explain the answer (reasons, results) Give an example 给出一个反例 前三个比较重要，第四个可有可无 可以分类讨论，有多种可能的直接分类扩展，如人们喜欢去什么地方，不一定只要说一个地方 PersonWhere do young people like to meet? shopping malls, cinemas, parks and gardens, library (+ 他们在这些场合做什么) What do young people talk about when they meet up? current happenings, celebrities like film stars, sports stars 对于我来说，我喜欢讨论subject，常可以给我advice and encouragement（不可数名词，不能加s） ObjectTraditions是否重要？(复数) preserve our traditions, connect us to the past, is a symbol of our history 举例：茶文化对我们中国人有特殊含义 Traditions对国家是否重要？ contributes a sense of belonging, represent the culture of country, 一些时候还变成国家的象征，如use china to name our country. Traditional Chinese products? Tea, china, traditional Chinese medicine 很多地方在special events喝茶，如wedding days，因为茶文化，我们created many kinds of teas, such as green, black, woolong, white… Place交通问题解决？","categories":[],"tags":[]},{"title":"Creative Cross-disciplinary Master's Student Seeking Ph.D. Position","slug":"Creative Cross-disciplinary Master's Student Seeking Ph.D. Position","date":"2022-08-13T10:39:05.000Z","updated":"2022-09-09T11:02:18.453Z","comments":true,"path":"2022/08/13/Creative Cross-disciplinary Master's Student Seeking Ph.D. Position/","link":"","permalink":"http://example.com/2022/08/13/Creative%20Cross-disciplinary%20Master's%20Student%20Seeking%20Ph.D.%20Position/","excerpt":"","text":"Personal detailsName: Zhang Zehong (Benedict Zhang) Email: &#122;&#x68;&#x61;&#x6e;&#103;&#98;&#x65;&#x6e;&#x65;&#x32;&#48;&#x31;&#57;&#64;&#x67;&#109;&#x61;&#105;&#108;&#46;&#x63;&#x6f;&#109;, &#122;&#104;&#97;&#x6e;&#x67;&#x7a;&#x68;&#95;&#x6f;&#x72;&#97;&#x6e;&#103;&#x65;&#64;&#49;&#x36;&#x33;&#46;&#99;&#x6f;&#109; Tel: 86-13313424614 Profile​ A graduate student with a solid research background and strong learning ability. I am interested in artificial intelligence for biomedicine, which is consistent with my graduate program. In terms of application, I am most interested in protein structure and function, -omics data analysis and drug-protein interaction prediction; in terms of technology, I think graph neural network and knowledge graph are very promising. EducationUniversity of Chinese Academy of Sciences (2020.9-2023.6), Shanghai, China Master of Drug Design Science (Supervisors: Prof. Jiang Hualiang and Prof. Mingyue Zheng) Focus on computer-aided drug design, especially artificial intelligent drug design. Chang Gung University (2018.6-2018.9), Taiwan, China Exchange programme (Supervisor: Assoc. Prof. Yi-Ting Chen) Concentration in Biological Mass Spectrometry. Acquiring knowledge about LC–MS proteomic technique, and analyzing proteomes of urine samples from renal cancer patients. Xiamen University (2016.9-2020.6), Xiamen, China Bachelor of Biochemistry and Biotechnology (Supervisor: Prof. Xianming Deng) Selected for “Mount Everest Plan” (a programme of China, offering special classes in fundamental sciences for Chinese top students) and “the Beutler institute“ (an institute established by several top universities in China, committed to the cultivation of outstanding talents in the field of life sciences). Learning the basics of biological science extensively and having research experience in several different sub-disciplines (natural product drug discovery, algology and cancer biology in Prof. Xianming Deng‘s, Assoc. Prof. Hong Xu‘s and Prof. Dawang Zhou‘s labs, respectively). Skills Programming Language: Python (main for machine learning and deep learning), R (main for biostatistics), Visual Basic Neural network models: CNN, GNN, Transformer, RNN, etc Machine learning models: Random Forest, Supprt Vector Model, XGBoost, LightGBM, etc. Python packages: NumPy, Pandas, Scikit-Learn, PyTorch (for artificial intelligence models), PyG, NetworkX (for graph algorithm), BioPython, RDKit (for bio and chem moleculars), Matplotlib (for visualizations), etc. Molecular docking: Schrödinger, PyMOL Protein crystal structure determination: molecular replacement, model building and refine with Phenix and CCP4 Others: MestReNova for NMR spectroscopy analysis, SPSS for biostatistical analysis Projects and publications A review about protein-drug interaction prediction (published, first author) Zhang, Z., Chen, L., Zhong, F., Wang, D., Jiang, J., Zhang, S., Jiang, H., Zheng, M. and Li, X., 2022. Graph neural network approaches for drug-target interactions. Current Opinion in Structural Biology, 73, p.102327. Machine learning-based mRNA nanovaccine enhances cancer immunotherapy (submitted to Nature Nanotechnology, co-first author) We collected two datasets from previous publications and used them to predict the transfection efficiency of nanocarriers, with four machine learning models (SVC, RF, LightGBM and XGBoost). And we used these models to find several high transfection efficiency nanocarriers and successfully design a mRNA nanovaccine, with experimental verification. GNN for Protein function prediction and directed evolution (waiting for experiment results) We designed a new deep-learning algorithm based on GNN to predict functional fitness for protein engineering, which outperforms previous models (DeepSequence, EVmutation, ECNet, and etc.) on most datasets. Now we are waiting for experimental data from cooperators to test our model. Antigen-antibody affinity prediction competition This task is to predict the affinity of antibody-antigen binding based on the amino acid sequence of antigen and antibody. I finished 12th out of 236 teams in the competition. (Team Name: 违规昵称Q98X72) Media platform I set up an official account on WeChat for my research group, which now has ~1600 followers. I also have my own official account (just like a blog, ~900 followers), where I publish my reading notes, some of which were translated into English to my blog. As a reviewer Now I am a reviewer of Artificial Intelligence in the Life Sciences. I have reviewed 4 articles with Prof. Mingyue Zheng (1 of Briefings in Bioinformatics, 1 of Bioengineering &amp; Translational Medicine, and 2 of Artificial Intelligence in the Life Sciences). Awards 2018 First Prize in Chinese Undergraduate Life Sciences Competition 2017, 2018 Chinese National Encourage Scholarship 2019 Course Scholarship of Immunology 2020-2023 Chinese Government Academic Scholarship 2017 Excellence Award of Chinese Undergraduate Mathematical Modeling Competition SportsDiving 2019 PADI Open Water Diver Triple jump 2017 fourth place in XMU sports meet 2016 eighth place in XMU sports meet 2015 gold medal in high school sports meet","categories":[],"tags":[{"name":"Personal info","slug":"Personal-info","permalink":"http://example.com/tags/Personal-info/"}]},{"title":"Biostatistic using R","slug":"Biostatistics using R","date":"2022-08-13T10:39:05.000Z","updated":"2022-08-18T03:00:28.315Z","comments":true,"path":"2022/08/13/Biostatistics using R/","link":"","permalink":"http://example.com/2022/08/13/Biostatistics%20using%20R/","excerpt":"","text":"Since there are biostatistics classes in this semester, which mainly rely on R language to complete, I tried to use R language to complete the example questions in each chapter of the bibliography one by one, and sorted out the R language related homework and answers. The bibliography is the fifth edition of Biostatistics edited by Chunxi Li, and the completed code is shared here. Chapter 4 Statistical inferenceStatistical inference is a method of making decisions about the parameters of a population, based on random sampling. 4.1 Hypothesis testing4.1.1 Steps of hypothesis testing4 steps of hypothesis testing: State the hypotheses (null hypothesis H0 and alternative hypothesis HA). Deciding significance level and test method (often choose significance levels &#x3D; 0.01 or 0.05). Calculating test statistic and P-value. The P-value is the probability of observing a sample statistic as extreme as the test statistic, assuming the null hypothesis is true. Whether to reject the null hypothesis. 4.1.2 Two-Tailed vs. One-Tailed TestTwo-tailed test: critical area of a distribution is two-sided whether a sample is greater than or less than a certain range of values One-tailed test: critical area of a distribution is one-sided either greater than or less than a certain value, but not both According to the testing requirements and professional knowledge, using one-tailed test as far as possible to improve the sensitivity of hypothesis testing. 4.1.3 Type I &amp; Type II ErrorsType I error is a false positive conclusion； Type II error is a false negative conclusion. Example: Type I vs Type II error You decide to get tested for COVID-19 based on mild symptoms. There are two errors that could potentially occur: Type I error (false positive): the test result says you have coronavirus, but you actually don’t. Type II error (false negative): the test result says you don’t have coronavirus, but you actually do. Null hypothesis is… TRUE FALSE Rejected Type I errorFalse positiveProbability &#x3D; α Correct decisionTrue positiveProbability &#x3D; 1-β Not rejected Correct decisionTrue negativeProbability &#x3D; 1-α Type I errorFalse negativeProbability &#x3D; β Reducing the alpha always comes at the cost of increasing beta, and vice versa. The null hypothesis distribution shows all possible results you’d obtain if the null hypothesis is true. The correct conclusion for any point on this distribution means not rejecting the null hypothesis. The alternative hypothesis distribution shows all possible results you’d obtain if the alternative hypothesis is true. The correct conclusion for any point on this distribution means rejecting the null hypothesis. 4.2 Hypothesis Test for Mean4.2.1 Hypothesis Test for a Mean The population variance σ2 is known When the population variance σ2 is known, no matter whether the sample is large (n&gt;&#x3D;30) or small (n&lt;30), the distribution of sample mean follows the normal distribution, and after standardization, it follows the standard normal distribution, namely the U distribution. Therefore, the u-test method was used to test the hypothesis. Example: The average body length and standard deviation of silver carp larvae raised by conventional methods in a fishery at 1 month old were 7.25cm and 1.58 cm, respectively. In order to improve the quality of larvae, a new method was adopted to raise the larvae. 100 larvae were randomly selected at the age of 1 month, and the average body length was 7.65cm. Is there any significant difference in body length between the new method and the conventional method at 1 month of age? 1234567891011121314151617181920# Method 1: Generate a batch of data conforming to the original parameters and perform a non-parametric test on the datanew_method &lt;- rnorm(100,mean = 7.65,sd = 1.58)# dnorm: normally distributed probability density function# pnorm: returns the integral from minus infinity to q, pnorm(0) = 0.5# qnorm: inverse function of pnorm# rnomr: Generate a set of random numbers according to normal distribution# Z-test on generated data# H0:μ = μ0 = 7.25, HA：μ ≠ μ0library(BSDA)z.test(x = new_method, # Samples are the generated data alternative = &quot;two.sided&quot;, # two-sided test mu = 7.25, # mean of the population = 7.25 sigma.x = 1.58) # population standard deviation# Here, because the data is randomly generated and normally distributed, the results may not be the same each time# My result: z = 2.2647, p-value = 0.02353 &lt; 0.05.# Therefore, the null hypothesis was rejected and the alternative hypothesis was accepted. The new method was different from the conventional method.# Because the mean value was greater than the population mean, the new method was significantly longer than the conventional method. My result: A z-test is a statistical test to determine whether two population means are different when the variances are known and the sample size is large. A z-test is a hypothesis test in which the z-statistic follows a normal distribution. A z-statistic, or z-score, is a number representing the result from the z-test. 1234567891011# Method 2: Calculating atep by step (u-test)x_bar &lt;- 7.65 # mean of samples = 7.65n &lt;- 100 # sample size = 100sigma &lt;- 1.58 # population standard deviation = 1.58miu &lt;- 7.25 # population mean = 7.25sigma_x_bar &lt;- sigma/sqrt(n) # calculate the sample standard deviationu &lt;- (x_bar - miu)/sigma_x_bar # convert to a standard normal distribution valueu # u = 2.531646u_0.05 &lt;- qnorm(0.975) # the right rejection region, two-sided testu_0.05 # u_0.05 = 1.959964# Thus u &gt; u_0.05, that is p &lt; 0.05，the new method was significantly longer than the conventional method. Example: We know that the average weight of a certain corn is 300g, standard deviation 9.5g. After spraying a plant growth regulator, randomly selected 9 ears of corn, the weights were 308, 305, 311, 298, 315, 300, 321, 294, 320 (g) respectively. Is there any effect of this regulator on ear weight? 12345678910111213weight &lt;- c(308,305,311,298,315,300,321,294,320)miu0 &lt;- 300 # the mean of corn earssigma &lt;- 9.5 # standard deviation# Z test# H0: μ = μ0 = 300, HA：μ ≠ μ0library(BSDA)z.test(x = weight, # Samples are the generated data alternative = &quot;two.sided&quot;, # two-sided test mu = miu0, # mean of the population sigma.x = sigma) # population standard deviation# z = 2.5263，p-value = 0.01153 &lt; 0.05, # The null hypothesis was rejected and the alternative hypothesis was accepted, and the mean of samples is larger than population mean, suggesting that spraying regulator could significantly increase ear weight of corn. The population variance σ2 is unknown When the population variance σ2 is unknown, as long as the sample size is n &gt;&#x3D; 30. According to the central limit theorem, the distribution of sample means approximately normal distribution. Therefore, the sample variance s2 can be used to estimate the population variance σ2, and the u test method is still used. Example: For the production of certain textiles, the average length of the cotton fibers needs to be more than 30 mm. The average length and standard deviation of a cotton variety with n&#x3D;400 were 30.2 mm and 2.5 mm, respectively. Is the fiber length of the cotton variety sufficient to produce textile production? 1 4.2.2 Hypothesis test for difference between two means The population variances σ12 and σ22 are known When the population variances σ12 and σ22 are known, no matter whether the sample is large (n&gt;&#x3D;30) or small (n&lt;30), the distributions of sample means follow the normal distribution. The u-test method was used to test the hypothesis. The population variances σ12 and σ22 are unknown n1 &gt;&#x3D; 30 and n2 &gt;&#x3D; 30, using u test (or z test). Example: 55 strains and 107 strains of the two rubber varieties were randomly sampled for cutting, the average yield of cutting was 95.4 mL&#x2F; plant and 77.6 mL&#x2F; plant, and the variance of cutting yield was 936.36 (mL&#x2F; plant)2 and 800.89 (mL&#x2F; plant)2, respectively. To test whether there is a significant difference in cutting yield between the two rubber varieties. 1234567891011121314151617# We don&#x27;t know which one has higher yield, because we don&#x27;t know their population mean. So we use two-tailed test.# H0:μ1 = μ2, HA:μ1 ≠ μ2n1 &lt;- 55 # Sample size of the first varietyn2 &lt;- 107 # Sample size of the second varietyx_bar_1 &lt;- 95.4 # The mean of the first varietyx_bar_2 &lt;- 77.6 # The mean of the second varietyvar_1 &lt;- 936.36 # The variance of the first varietyvar_2 &lt;- 800.89 # The variance of the second varietys &lt;- sqrt(var_1/n1 + var_2/n2)u &lt;- (x_bar_1 - x_bar_2)/su # u = 3.595433# Significance level α=0.01, In two-sided test, one side is 0.995u_0.01 &lt;- qnorm(0.995)u_0.01 # u_0.01 = 2.575829# u &gt; u_0.01, the null hypothesis was rejected and the alternative hypothesis was accepted, that is, the yield of the two varieties was significantly different. n1 &lt; 30 or n2 &lt; 30, using t test. When two population variances σ12 and σ22 are unknown, and n1 or n2 &lt; 30 are less than 30, the mean difference no longer follows a normal distribution, but follows a t-distribution, so the two-sample t-test is used. Example: One-month-old rats were fed with high-protein and low-protein diets. After 3 months, the weight gain (g) of rats in the two groups was measured. The data of the two groups were respectively: High protein group: 134,146,106,119,124,161,107,83,113,129,97,123; Low protein group: 70,118,101,85,107,132,94. Is there any difference in the weight gain of rats fed two kinds of diets? 1234567891011121314151617181920212223high_group_weight &lt;- c(134,146,106,119,124,161,107,83,113,129,97,123)low_group_weight &lt;- c(70,118,101,85,107,132,94)rat_weight &lt;- c(high_group_weight,low_group_weight) # Concat the two vectorslabel &lt;- c(rep(&#x27;high protein&#x27;,times=length(high_group_weight)), rep(&#x27;low protein&#x27;,times=length(low_group_weight))) # Label every value of the concated vectorrat_weight_df &lt;- data.frame(rat_weight,label)# F-test, whether σ₁² = σ₂²# H0: σ²₁ = σ²₂, HA: σ²₁ ≠ σ²₂F_test &lt;- aov(rat_weight~label, # Grouping rat weight according to label data = rat_weight_df)summary(F_test) # Show complete F test table# F = 3.67, P = 0.0724 &gt; 0.05, Supports the null hypothesis that the variances are equal.# t test, whether μ1=μ2# H0: μ1 = μ2, HA: μ1 ≠ μ2t.test(x=high_group_weight,y=low_group_weight, alternative = &#x27;two.sided&#x27;, var.equal = TRUE, # The variances are equal conf.level = 0.95) # Confidence interval# t = 1.91, p = 0.07238 &gt; 0.05. The null hypothesis was supported that there was no difference in weight gain between the two diets. F test result: t test result: Example: The results of the investigation of 1000-grain weight (g) of two wheat varieties are shown below. Variety A: 50,47,42,43,39,51,43,38,44,37; Variety B :36,38,37,38,36,39,37,35,33,37. Whether the 1000-grain weight of the two varieties was significantly different? 123456789101112131415161718192021222324a_weight &lt;- c(50,47,42,43,39,51,43,38,44,37) # Variety Ab_weight &lt;- c(36,38,37,38,36,39,37,35,33,37) # Variety Bseed_weight &lt;- c(a_weight,b_weight) # Concat the two vectorsbreed &lt;- c(rep(&#x27;A&#x27;,times=length(a_weight)), rep(&#x27;B&#x27;,times=length(b_weight))) # Add labelsseed_weight_df &lt;- data.frame(seed_weight,breed)# F-test, whether σ₁² = σ₂²# H0: σ²₁ = σ²₂, HA: σ²₁ ≠ σ²₂F_test &lt;- aov(seed_weight~breed, data = seed_weight_df)summary(F_test)# F = 17.88, p = 0.000506 &lt; 0.01. There is a significant difference between the two variances.# t test, whether μ1=μ2# H0: μ1 = μ2, HA: μ1 ≠ μ2t.test(x=a_weight,y=b_weight, alternative = &#x27;two.sided&#x27;, # two-sided test, we don&#x27;t know which population mean is higher. var.equal = FALSE, # The two variances are not equal conf.level = 0.95) # Confidence interval# t = 4.228, p = 0.00135 &lt; 0.01. There was significant difference in 1000-grain weight between the two varieties.# Because mean of x, mean of y is 43.4 and 36.6 respectively, the 1000-grain weight of A was significantly higher than that of B. F test result: t test result:","categories":[],"tags":[{"name":"Reading notes","slug":"Reading-notes","permalink":"http://example.com/tags/Reading-notes/"}]}],"categories":[],"tags":[{"name":"Personal info","slug":"Personal-info","permalink":"http://example.com/tags/Personal-info/"},{"name":"Reading notes","slug":"Reading-notes","permalink":"http://example.com/tags/Reading-notes/"}]}