{"meta":{"title":"Hexo","subtitle":"","description":"We all have our places in the world.","author":"Zhang Zehong","url":"http://example.com","root":"/"},"pages":[],"posts":[{"title":"","slug":"Biostatistics using R","date":"2022-08-17T13:08:54.508Z","updated":"2022-08-17T14:29:34.178Z","comments":true,"path":"2022/08/17/Biostatistics using R/","link":"","permalink":"http://example.com/2022/08/17/Biostatistics%20using%20R/","excerpt":"","text":"Since there are biostatistics classes in this semester, which mainly rely on R language to complete, I tried to use R language to complete the example questions in each chapter of the bibliography one by one, and sorted out the R language related homework and answers. The bibliography is the fifth edition of Biostatistics edited by Chunxi Li, and the completed code is shared here. Chapter 4 Statistical inferenceStatistical inference is a method of making decisions about the parameters of a population, based on random sampling. 4.1 Hypothesis testing4 steps of hypothesis testing: State the hypotheses (null hypothesis H0 and alternative hypothesis HA). Deciding significance level and test method (often choose significance levels &#x3D; 0.01 or 0.05). Calculating test statistic and P-value. The P-value is the probability of observing a sample statistic as extreme as the test statistic, assuming the null hypothesis is true. Whether to reject the null hypothesis. 4.2 Two-Tailed vs. One-Tailed TestTwo-tailed test: critical area of a distribution is two-sided whether a sample is greater than or less than a certain range of values One-tailed test: critical area of a distribution is one-sided either greater than or less than a certain value, but not both According to the testing requirements and professional knowledge, using one-tailed test as far as possible to improve the sensitivity of hypothesis testing.","categories":[],"tags":[]},{"title":"Creative Cross-disciplinary Master's Student Seeking Ph.D. Position","slug":"Creative Cross-disciplinary Master's Student Seeking Ph.D. Position","date":"2022-08-13T10:39:05.000Z","updated":"2022-08-17T11:51:15.604Z","comments":true,"path":"2022/08/13/Creative Cross-disciplinary Master's Student Seeking Ph.D. Position/","link":"","permalink":"http://example.com/2022/08/13/Creative%20Cross-disciplinary%20Master's%20Student%20Seeking%20Ph.D.%20Position/","excerpt":"","text":"Personal detailsName: Zhang Zehong (Benedict Zhang) Email: &#122;&#104;&#x61;&#x6e;&#x67;&#98;&#x65;&#110;&#101;&#x32;&#x30;&#x31;&#57;&#64;&#103;&#x6d;&#97;&#105;&#x6c;&#46;&#x63;&#111;&#109;, &#x7a;&#104;&#x61;&#x6e;&#103;&#x7a;&#104;&#95;&#x6f;&#x72;&#x61;&#110;&#x67;&#x65;&#64;&#x31;&#x36;&#51;&#x2e;&#x63;&#x6f;&#x6d; Tel: 86-13313424614 Profile​ A graduate student with a solid research background and strong learning ability. I am interested in artificial intelligence for biomedicine, which is consistent with my graduate program. In terms of application, I am most interested in protein structure and function, -omics data analysis and drug-protein interaction prediction; in terms of technology, I think graph neural network and knowledge graph are very promising. EducationUniversity of Chinese Academy of Sciences (2020.9-2023.6), Shanghai, China Master of Drug Design Science (Supervisors: Prof. Jiang Hualiang and Prof. Mingyue Zheng) Focus on computer-aided drug design, especially artificial intelligent drug design. Chang Gung University (2018.6-2018.9), Taiwan, China Exchange programme (Supervisor: Assoc. Prof. Yi-Ting Chen) Concentration in Biological Mass Spectrometry. Acquiring knowledge about LC–MS proteomic technique, and analyzing proteomes of urine samples from renal cancer patients. Xiamen University (2016.9-2020.6), Xiamen, China Bachelor of Biochemistry and Biotechnology (Supervisor: Prof. Xianming Deng) Selected for “Mount Everest Plan” (a programme of China, offering special classes in fundamental sciences for Chinese top students) and “the Beutler institute“ (an institute established by several top universities in China, committed to the cultivation of outstanding talents in the field of life sciences). Learning the basics of biological science extensively and having research experience in several different sub-disciplines (natural product drug discovery, algology and cancer biology in Prof. Xianming Deng‘s, Assoc. Prof. Hong Xu‘s and Prof. Dawang Zhou‘s labs, respectively). Skills Programming Language: Python (main for machine learning and deep learning), R (main for biostatistics), Visual Basic Neural network models: CNN, GNN, Transformer, RNN, etc Machine learning models: Random Forest, Supprt Vector Model, XGBoost, LightGBM, etc. Python packages: NumPy, Pandas, Scikit-Learn, PyTorch (for artificial intelligence models), PyG, NetworkX (for graph algorithm), BioPython, RDKit (for bio and chem moleculars), Matplotlib (for visualizations), etc. Molecular docking: Schrödinger, PyMOL Protein crystal structure determination: molecular replacement, model building and refine with Phenix and CCP4 Others: MestReNova for NMR spectroscopy analysis, SPSS for biostatistical analysis Projects and publications A review about protein-drug interaction prediction (published, first author) Zhang, Z., Chen, L., Zhong, F., Wang, D., Jiang, J., Zhang, S., Jiang, H., Zheng, M. and Li, X., 2022. Graph neural network approaches for drug-target interactions. Current Opinion in Structural Biology, 73, p.102327. Using machine learning models predict nanocarriers’ transfection efficiency (submitted, co-first author) We collected two datasets from previous publications and used them to predict the transfection efficiency of nanocarriers, with four machine learning models (SVC, RF, LightGBM and XGBoost). And we used these models to find several high transfection efficiency nanocarriers, with experimental verification. GNN for Protein function prediction and directed evolution (waiting for experiment results) We designed a new deep-learning algorithm based on GNN to predict functional fitness for protein engineering, which outperforms previous models (DeepSequence, EVmutation, ECNet, and etc.) on most datasets. Now we are waiting for experimental data from cooperators to test our model. Antigen-antibody affinity prediction competition This task is to predict the affinity of antibody-antigen binding based on the amino acid sequence of antigen and antibody. I finished 12th out of 236 teams in the competition. (Team Name: 违规昵称Q98X72) Media platform I set up an official account on WeChat for my research group, which now has about 1600 followers. I also have my own official account (just like a blog, around 900 followers), where I publish my reading notes, some of which were translated into English to my blog. As a reviewer Now I am a reviewer of Artificial Intelligence in the Life Sciences. I have reviewed 4 articles with Prof. Mingyue Zheng (1 of Briefings in Bioinformatics, 1 of Bioengineering &amp; Translational Medicine, and 2 of Artificial Intelligence in the Life Sciences). Participated in the writing of two books Chapter 23 of《高等药物化学》（第二版）(Advanced pharmaceutical chemistry, second edition). I wrote the section about machine learning in drug repurposing. This book is not yet published, but the first edition is available (ISBN：9787122104090). 《人工智能与药物设计》(Artificial intelligence for drug design). I co-wrote the section about artificial intelligence for drug toxicity prediction, including liver toxicity, dermal toxicity, and mutagenesis. Awards 2018 First Prize in Chinese Undergraduate Life Sciences Competition 2017, 2018 Chinese National Encourage Scholarship 2019 Course Scholarship of Immunology 2020-2023 Chinese Government Academic Scholarship 2017 Excellence Award of Chinese Undergraduate Mathematical Modeling Competition SportsDiving 2019 PADI Open Water Diver Triple jump 2017 fourth place in XMU sports meet 2016 eighth place in XMU sports meet 2015 gold medal in high school sports meet","categories":[],"tags":[{"name":"Personal info","slug":"Personal-info","permalink":"http://example.com/tags/Personal-info/"}]}],"categories":[],"tags":[{"name":"Personal info","slug":"Personal-info","permalink":"http://example.com/tags/Personal-info/"}]}