{"meta":{"title":"Hexo","subtitle":"","description":"AI for biomedicine<br />Chinese Academy of Sciences","author":"Zhang Zehong","url":"http://example.com","root":"/"},"pages":[{"title":"tags","date":"2022-08-17T14:36:36.000Z","updated":"2022-08-17T14:44:00.520Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2022-08-17T14:44:55.000Z","updated":"2022-08-17T14:45:13.882Z","comments":true,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"Creative Cross-disciplinary Master's Student Seeking Ph.D. Position","slug":"Creative Cross-disciplinary Master's Student Seeking Ph.D. Position","date":"2022-08-13T10:39:05.000Z","updated":"2022-08-17T23:20:32.164Z","comments":true,"path":"2022/08/13/Creative Cross-disciplinary Master's Student Seeking Ph.D. Position/","link":"","permalink":"http://example.com/2022/08/13/Creative%20Cross-disciplinary%20Master's%20Student%20Seeking%20Ph.D.%20Position/","excerpt":"","text":"Personal detailsName: Zhang Zehong (Benedict Zhang) Email: &#122;&#104;&#97;&#x6e;&#x67;&#98;&#x65;&#110;&#x65;&#x32;&#x30;&#x31;&#57;&#x40;&#103;&#x6d;&#x61;&#105;&#x6c;&#46;&#99;&#x6f;&#x6d;, &#122;&#104;&#97;&#110;&#x67;&#122;&#104;&#95;&#x6f;&#x72;&#97;&#x6e;&#x67;&#x65;&#x40;&#x31;&#54;&#x33;&#46;&#x63;&#x6f;&#x6d; Tel: 86-13313424614 Profile​ A graduate student with a solid research background and strong learning ability. I am interested in artificial intelligence for biomedicine, which is consistent with my graduate program. In terms of application, I am most interested in protein structure and function, -omics data analysis and drug-protein interaction prediction; in terms of technology, I think graph neural network and knowledge graph are very promising. EducationUniversity of Chinese Academy of Sciences (2020.9-2023.6), Shanghai, China Master of Drug Design Science (Supervisors: Prof. Jiang Hualiang and Prof. Mingyue Zheng) Focus on computer-aided drug design, especially artificial intelligent drug design. Chang Gung University (2018.6-2018.9), Taiwan, China Exchange programme (Supervisor: Assoc. Prof. Yi-Ting Chen) Concentration in Biological Mass Spectrometry. Acquiring knowledge about LC–MS proteomic technique, and analyzing proteomes of urine samples from renal cancer patients. Xiamen University (2016.9-2020.6), Xiamen, China Bachelor of Biochemistry and Biotechnology (Supervisor: Prof. Xianming Deng) Selected for “Mount Everest Plan” (a programme of China, offering special classes in fundamental sciences for Chinese top students) and “the Beutler institute“ (an institute established by several top universities in China, committed to the cultivation of outstanding talents in the field of life sciences). Learning the basics of biological science extensively and having research experience in several different sub-disciplines (natural product drug discovery, algology and cancer biology in Prof. Xianming Deng‘s, Assoc. Prof. Hong Xu‘s and Prof. Dawang Zhou‘s labs, respectively). Skills Programming Language: Python (main for machine learning and deep learning), R (main for biostatistics), Visual Basic Neural network models: CNN, GNN, Transformer, RNN, etc Machine learning models: Random Forest, Supprt Vector Model, XGBoost, LightGBM, etc. Python packages: NumPy, Pandas, Scikit-Learn, PyTorch (for artificial intelligence models), PyG, NetworkX (for graph algorithm), BioPython, RDKit (for bio and chem moleculars), Matplotlib (for visualizations), etc. Molecular docking: Schrödinger, PyMOL Protein crystal structure determination: molecular replacement, model building and refine with Phenix and CCP4 Others: MestReNova for NMR spectroscopy analysis, SPSS for biostatistical analysis Projects and publications A review about protein-drug interaction prediction (published, first author) Zhang, Z., Chen, L., Zhong, F., Wang, D., Jiang, J., Zhang, S., Jiang, H., Zheng, M. and Li, X., 2022. Graph neural network approaches for drug-target interactions. Current Opinion in Structural Biology, 73, p.102327. Using machine learning models predict nanocarriers’ transfection efficiency (submitted, co-first author) We collected two datasets from previous publications and used them to predict the transfection efficiency of nanocarriers, with four machine learning models (SVC, RF, LightGBM and XGBoost). And we used these models to find several high transfection efficiency nanocarriers, with experimental verification. GNN for Protein function prediction and directed evolution (waiting for experiment results) We designed a new deep-learning algorithm based on GNN to predict functional fitness for protein engineering, which outperforms previous models (DeepSequence, EVmutation, ECNet, and etc.) on most datasets. Now we are waiting for experimental data from cooperators to test our model. Antigen-antibody affinity prediction competition This task is to predict the affinity of antibody-antigen binding based on the amino acid sequence of antigen and antibody. I finished 12th out of 236 teams in the competition. (Team Name: 违规昵称Q98X72) Media platform I set up an official account on WeChat for my research group, which now has about 1600 followers. I also have my own official account (just like a blog, around 900 followers), where I publish my reading notes, some of which were translated into English to my blog. As a reviewer Now I am a reviewer of Artificial Intelligence in the Life Sciences. I have reviewed 4 articles with Prof. Mingyue Zheng (1 of Briefings in Bioinformatics, 1 of Bioengineering &amp; Translational Medicine, and 2 of Artificial Intelligence in the Life Sciences). Participated in the writing of two books Chapter 23 of《高等药物化学》（第二版）(Advanced pharmaceutical chemistry, second edition). I wrote the section about machine learning in drug repurposing. This book is not yet published, but the first edition is available (ISBN：9787122104090). 《人工智能与药物设计》(Artificial intelligence for drug design). I co-wrote the section about artificial intelligence for drug toxicity prediction, including liver toxicity, dermal toxicity, and mutagenesis. Awards 2018 First Prize in Chinese Undergraduate Life Sciences Competition 2017, 2018 Chinese National Encourage Scholarship 2019 Course Scholarship of Immunology 2020-2023 Chinese Government Academic Scholarship 2017 Excellence Award of Chinese Undergraduate Mathematical Modeling Competition SportsDiving 2019 PADI Open Water Diver Triple jump 2017 fourth place in XMU sports meet 2016 eighth place in XMU sports meet 2015 gold medal in high school sports meet","categories":[],"tags":[{"name":"Personal info","slug":"Personal-info","permalink":"http://example.com/tags/Personal-info/"}]},{"title":"Biostatistic using R","slug":"Biostatistics using R","date":"2022-08-13T10:39:05.000Z","updated":"2022-08-18T02:21:42.700Z","comments":true,"path":"2022/08/13/Biostatistics using R/","link":"","permalink":"http://example.com/2022/08/13/Biostatistics%20using%20R/","excerpt":"","text":"Since there are biostatistics classes in this semester, which mainly rely on R language to complete, I tried to use R language to complete the example questions in each chapter of the bibliography one by one, and sorted out the R language related homework and answers. The bibliography is the fifth edition of Biostatistics edited by Chunxi Li, and the completed code is shared here. Chapter 4 Statistical inferenceStatistical inference is a method of making decisions about the parameters of a population, based on random sampling. 4.1 Hypothesis testing4.1.1 Steps of hypothesis testing4 steps of hypothesis testing: State the hypotheses (null hypothesis H0 and alternative hypothesis HA). Deciding significance level and test method (often choose significance levels &#x3D; 0.01 or 0.05). Calculating test statistic and P-value. The P-value is the probability of observing a sample statistic as extreme as the test statistic, assuming the null hypothesis is true. Whether to reject the null hypothesis. 4.1.2 Two-Tailed vs. One-Tailed TestTwo-tailed test: critical area of a distribution is two-sided whether a sample is greater than or less than a certain range of values One-tailed test: critical area of a distribution is one-sided either greater than or less than a certain value, but not both According to the testing requirements and professional knowledge, using one-tailed test as far as possible to improve the sensitivity of hypothesis testing. 4.1.3 Type I &amp; Type II ErrorsType I error is a false positive conclusion； Type II error is a false negative conclusion. Example: Type I vs Type II error You decide to get tested for COVID-19 based on mild symptoms. There are two errors that could potentially occur: Type I error (false positive): the test result says you have coronavirus, but you actually don’t. Type II error (false negative): the test result says you don’t have coronavirus, but you actually do. Null hypothesis is… TRUE FALSE Rejected Type I errorFalse positiveProbability &#x3D; α Correct decisionTrue positiveProbability &#x3D; 1-β Not rejected Correct decisionTrue negativeProbability &#x3D; 1-α Type I errorFalse negativeProbability &#x3D; β Reducing the alpha always comes at the cost of increasing beta, and vice versa. The null hypothesis distribution shows all possible results you’d obtain if the null hypothesis is true. The correct conclusion for any point on this distribution means not rejecting the null hypothesis. The alternative hypothesis distribution shows all possible results you’d obtain if the alternative hypothesis is true. The correct conclusion for any point on this distribution means rejecting the null hypothesis. 4.2 Hypothesis Test for Mean4.2.1 Hypothesis Test for a Mean The population variance σ2 is known When the population variance σ2 is known, no matter whether the sample is large (n&gt;&#x3D;30) or small (n&lt;30), the distribution of sample mean follows the normal distribution, and after standardization, it follows the standard normal distribution, namely the U distribution. Therefore, the u-test method was used to test the hypothesis. Example: The average body length and standard deviation of silver carp larvae raised by conventional methods in a fishery at 1 month old were 7.25cm and 1.58 cm, respectively. In order to improve the quality of larvae, a new method was adopted to raise the larvae. 100 larvae were randomly selected at the age of 1 month, and the average body length was 7.65cm. Is there any significant difference in body length between the new method and the conventional method at 1 month of age? 1234567891011121314151617181920# Method 1: Generate a batch of data conforming to the original parameters and perform a non-parametric test on the datanew_method &lt;- rnorm(100,mean = 7.65,sd = 1.58)# dnorm: normally distributed probability density function# pnorm: returns the integral from minus infinity to q, pnorm(0) = 0.5# qnorm: inverse function of pnorm# rnomr: Generate a set of random numbers according to normal distribution# Z-test on generated data# H0:μ = μ0 = 7.25, HA：μ ≠ μ0library(BSDA)z.test(x = new_method, # Samples are the generated data alternative = &quot;two.sided&quot;, # two-sided test mu = 7.25, # mean of the population = 7.25 sigma.x = 1.58) # population standard deviation# Here, because the data is randomly generated and normally distributed, the results may not be the same each time# My result: z = 2.2647, p-value = 0.02353 &lt; 0.05.# Therefore, the null hypothesis was rejected and the alternative hypothesis was accepted. The new method was different from the conventional method.# Because the mean value was greater than the population mean, the new method was significantly longer than the conventional method. My result: A z-test is a statistical test to determine whether two population means are different when the variances are known and the sample size is large. A z-test is a hypothesis test in which the z-statistic follows a normal distribution. A z-statistic, or z-score, is a number representing the result from the z-test. 1234567891011# Method 2: Calculating atep by step (u-test)x_bar &lt;- 7.65 # mean of samples = 7.65n &lt;- 100 # sample size = 100sigma &lt;- 1.58 # population standard deviation = 1.58miu &lt;- 7.25 # population mean = 7.25sigma_x_bar &lt;- sigma/sqrt(n) # calculate the sample standard deviationu &lt;- (x_bar - miu)/sigma_x_bar # convert to a standard normal distribution valueu # u = 2.531646u_0.05 &lt;- qnorm(0.975) # the right rejection region, two-sided testu_0.05 # u_0.05 = 1.959964# Thus u &gt; u_0.05, that is p &lt; 0.05，the new method was significantly longer than the conventional method. Example: We know that the average weight of a certain corn is 300g, standard deviation 9.5g. After spraying a plant growth regulator, randomly selected 9 ears of corn, the weights were 308, 305, 311, 298, 315, 300, 321, 294, 320 (g) respectively. Is there any effect of this regulator on ear weight? 12345678910111213weight &lt;- c(308,305,311,298,315,300,321,294,320)miu0 &lt;- 300 # the mean of corn earssigma &lt;- 9.5 # standard deviation# Z test# H0: μ = μ0 = 300, HA：μ ≠ μ0library(BSDA)z.test(x = weight, # Samples are the generated data alternative = &quot;two.sided&quot;, # two-sided test mu = miu0, # mean of the population sigma.x = sigma) # population standard deviation# z = 2.5263，p-value = 0.01153 &lt; 0.05, # The null hypothesis was rejected and the alternative hypothesis was accepted, and the mean of samples is larger than population mean, suggesting that spraying regulator could significantly increase ear weight of corn. The population variance σ2 is unknown When the population variance σ2 is unknown, as long as the sample size is n &gt;&#x3D; 30. According to the central limit theorem, the distribution of sample means approximately normal distribution. Therefore, the sample variance s2 can be used to estimate the population variance σ2, and the u test method is still used. Example: For the production of certain textiles, the average length of the cotton fibers needs to be more than 30 mm. The average length and standard deviation of a cotton variety with n&#x3D;400 were 30.2 mm and 2.5 mm, respectively. Is the fiber length of the cotton variety sufficient to produce textile production? 1 4.2.2 Hypothesis test for difference between two means The population variances σ12 and σ22 are known When the population variances σ12 and σ22 are known, no matter whether the sample is large (n&gt;&#x3D;30) or small (n&lt;30), the distributions of sample means follow the normal distribution. The u-test method was used to test the hypothesis. The population variances σ12 and σ22 are unknown n1&gt;&#x3D;30 and n2&gt;&#x3D;30, using u test (or z test). Example: 55 strains and 107 strains of the two rubber varieties were randomly sampled for cutting, the average yield of cutting was 95.4 mL&#x2F; plant and 77.6 mL&#x2F; plant, and the variance of cutting yield was 936.36 (mL&#x2F; plant)2 and 800.89 (mL&#x2F; plant)2, respectively. To test whether there is a significant difference in cutting yield between the two rubber varieties. 1234567891011121314151617# We don&#x27;t know which one has higher yield, because we don&#x27;t know their population mean. So we use two-tailed test.# H0:μ1 = μ2, HA:μ1 ≠ μ2n1 &lt;- 55 # Sample size of the first varietyn2 &lt;- 107 # Sample size of the second varietyx_bar_1 &lt;- 95.4 # The mean of the first varietyx_bar_2 &lt;- 77.6 # The mean of the second varietyvar_1 &lt;- 936.36 # The variance of the first varietyvar_2 &lt;- 800.89 # The variance of the second varietys &lt;- sqrt(var_1/n1 + var_2/n2)u &lt;- (x_bar_1 - x_bar_2)/su # u = 3.595433# Significance level α=0.01, In two-sided test, one side is 0.995u_0.01 &lt;- qnorm(0.995)u_0.01 # u_0.01 = 2.575829# u &gt; u_0.01, the null hypothesis was rejected and the alternative hypothesis was accepted, that is, the yield of the two varieties was significantly different.","categories":[],"tags":[{"name":"Reading notes","slug":"Reading-notes","permalink":"http://example.com/tags/Reading-notes/"}]}],"categories":[],"tags":[{"name":"Personal info","slug":"Personal-info","permalink":"http://example.com/tags/Personal-info/"},{"name":"Reading notes","slug":"Reading-notes","permalink":"http://example.com/tags/Reading-notes/"}]}